#include <iostream>
using namespace std;

int main() {
    //Даны натуральные числа от 20 до 50.Напечатать те из них, которые делятся на 3, но не делятся на 5.

    //int i;
    //for (i = 20; i <= 50; i++)
    //{
    //int	k = i % 3;
    //int	y = i % 5;
    //if ((k == 0) && (y != 0))
    //	{
    //		cout << i << " ";
    //	}
    //}
    //9. даны натуральные числа от 35 до 87. Найти и напечатать те из них, которые при делении на 7 дают остаток 1, 2 или 5.
    //        for (int i = 35; i <= 87; i++){
    //        
    //            if (i % 7 == 1 || i % 7 == 2 || i % 7 == 5)
    //                cout << i << endl;
    //    }
        //10. Даны натуральные числа от 1 до 50. Найти сумму тех из них, которые делятся на 5 или на 7.
        /*int r = 0;
        int i = 0, y = 0;

        while (i != 50)
        {
            i++;
            if ((i % 5) == 0 || (i % 7) == 0)
            {
                r++;
                cout << r << " " << i << endl;
                y += i;
            }
        }
        cout << "sum = " << y;*/
        //11. Напечатать те из двузначных чисел которые делятся на 4, но не делятся на 6.
      /*  int q, w, e;
        for (q = 10; q <= 99 ; q++) {
            w = q % 4;
            e = q % 6;
            if ((w == 0)&&(e!=0)){
                cout << q<< endl;
            }
        } */
        //12 Найти произведение двузначных нечетных чисел кратных 13.
    int a, s, k;
    for (a > 9; a < 100; a++) {

    }

}